package javateam4.lesson3;

public class Stadium {
    public static void main(String[] args) {

    // Task #1
        // int секции
        // int трибун в секции
        // int мест на трибуне
        // String название стадиона (Черноморец, Спартак)

        // три метода с названием countStadium():
        // 1. считает общую вместимость стадиона (возвращает int)
        // 2. мест в секции (мест в трибуне * трибун в секции)
        // 3. считает общую вместимость стадиона + название (возвращает String)

        // Task #2

        // Зоопарк

        // каждого от 2 до 30
        //        мишки
        //        тигры
        //        попугаи
        //        слоны
        //        еноты

        // известно, что количество заверей
        // увеличивается каждый год на определенный коофициент:

//                мишки на 30%
//                тигры на 20%
//                попугаи на 40%
//                слоны на 5%
//                еноты на 80%

//        1) посчитать c помощью метода countAnimals() - сколько зверей в зоопарке в этом году;
//        2) с помощью метода countAnimalsNextYear() посчитать - сколько их будет через год, учитывая коэффициенты;
//        3) сделать такой же метод countAnimalsNextYear() но с количеством зверей 6
//            в зоопарк закупят пум (от 2 до 30)

        // Task #3
//        Самолеты
//        Параметры самолетов:
//           String type = "Jet";
//           String name = "F52";
//           int firstClassPassengers = 20;
//          int int secondClassPassengers = 250;
//
//        У нас есть три типа самолетов:
//        истребители:  тип + имя
//
//        пассажирские без бизнес класса:  тип + имя + 2-го класс
//
//        пассажирские с бизнес классом:   тип + имя + 1й класс + 2й класс
//
//        Сделать три метода с одним названием для каждого типа самолета.
//        На вход каждого метода передавать необходимое колличество параметров.

//        buildAirplane("Jet", "F52");
//        buildAirplane("Boeing", "747", 300);
//        buildAirplane("Boeing", "747", 300, 25);

        // Самолет Jet, модель F52
        // Самолет Boeing, модель 777, колличество пассажиров 350

    }
}
